#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
data.yandex_client_config.this: Reading...
yandex_kms_symmetric_key.key-a: Refreshing state... [id=abj995sp9tjafbuqlsfc]
data.yandex_client_config.this: Read complete after 0s [id=3581366454]
yandex_storage_bucket.terraform_state: Refreshing state... [id=yds-terraform-state-backend]
aws_dynamodb_table.terraform_state_locks: Refreshing state... [id=yds-terraform-state-locks]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_dynamodb_table.terraform_state_locks will be created
  + resource "aws_dynamodb_table" "terraform_state_locks" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "LockID"
      + id               = (known after apply)
      + name             = "yds-terraform-state-locks"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = (known after apply)

      + attribute {
          + name = "LockID"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```

</details>

Results for commit: 5a516a46544ea54b653e246d3d7996ff6bdbede0

*Pusher: @ptishkin, Action: `pull_request`, Working Directory: `backend`, Workflow: `Terraform CI/CD Backend`*